backend/controllers/JudgementController.php

    public function actionCreate()
    {
        $model = new Judgement();
//        print_r(Yii::$app->user->id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `test_judgement` (`title`, `answer`, `admin_id`, `create_time`, `update_time`, `score`) VALUES ('对坡体中的裂隙、缝、空洞,可用片石填补空洞,水泥砂浆勾缝等措施防止裂隙、缝、空洞的进一步发展。', '1', 8, 1522322830, 1522322830, 5)