common/models/Post.php

SELECT COUNT(*) FROM `test_comment` WHERE (`post_id`=1) AND (`status`='已审核')
---
    public function getCommentCount()
    {
        return Comment::find()->where(['post_id' => $this->id,'status' => '已审核'])->count();

SELECT COUNT(*) FROM `test_post`
---
    public static function findTagsWeight($limit = 20)
    {
        $tag_size_level = 5;
        $models = Post::find()->orderBy('times desc')->limit($limit)->all();
        $total = Post::find()->limit($limit)->count();