frontend/views/site/index.php

                <ul class="list-group">

                    <li class="list-group-item">
                        <span class="glyphicon glyphicon-search" aria-hidden="true"></span>查找文章(<?= Post::find()->count();?>)
---
SELECT COUNT(*) FROM `test_post`